package webby.commons.text

object StdLetterWidths {
  // ------------------------------- Font definitions -------------------------------

  // Эти значения описывают ширину символов в заданном промежутке для шрифта 13px Tahoma.
  // Код генерируется на странице /public/html/test/letter-width.html
  val tahoma13 = new CharWidthUnion(4, 7, Seq(
    new CharWidths(0x21, 0x7e, Array(4, 5, 9, 7, 13, 9, 3, 5, 5, 7, 9, 4, 5, 4, 5, 7, 7, 7, 7, 7, 7, 7, 7, 7, 7, 5, 5, 9, 9, 9, 6, 12, 8, 8, 8, 9, 7, 7, 9, 9, 5, 5, 8, 6, 10, 9, 9, 7, 9, 8, 7, 8, 9, 8, 12, 8, 7, 7, 5, 5, 5, 9, 7, 7, 7, 7, 6, 7, 7, 4, 7, 7, 3, 4, 6, 3, 11, 7, 7, 7, 7, 5, 6, 4, 7, 6, 10, 6, 6, 6, 6, 5, 6, 9)),
    new CharWidths(0x400, 0x451, Array(7, 7, 9, 7, 8, 7, 5, 5, 5, 13, 13, 9, 8, 9, 7, 9, 8, 8, 8, 7, 9, 7, 12, 7, 9, 9, 8, 9, 10, 9, 9, 9, 7, 8, 8, 7, 10, 8, 9, 8, 12, 12, 9, 10, 8, 8, 12, 8, 7, 7, 7, 5, 7, 7, 10, 6, 7, 7, 6, 7, 8, 7, 7, 7, 7, 6, 6, 6, 10, 6, 7, 7, 10, 10, 7, 9, 7, 6, 10, 7, 7, 7))))
}
